{
  "workouts": [
    {
      "id": 1,
      "name": "Core Blaster\n(For Beginners)",
      "description": "This workout is designed for beginners to strengthen and tone their core muscles. The workout includes 12 exercises that target the abs and waist using bodyweight only.\nPerform each exercise for 30 seconds, with a 15-second rest in between.",
      "image": "https://t3.ftcdn.net/jpg/02/56/17/92/360_F_256179223_FDWWNhqs8afJPs2W0iUUptiFXte4K8gP.jpg",
      "exercises": [
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0274.gif",
          "id": "0274",
          "name": "crunch floor",
          "target": "abs",
          "description": "Lie down on your back with your knees bent, feet flat on the floor, and hands behind your head. Lift your shoulders off the floor, contract your abs, and exhale as you crunch up towards your knees.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0003.gif",
          "id": "0003",
          "name": "air bike",
          "target": "abs",
          "description": "Lie down on your back with your hands behind your head and legs raised and bent at a 90-degree angle. Extend your right leg as you twist your left elbow to meet it, then switch sides, bringing your left knee to your right elbow.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0262.gif",
          "id": "0262",
          "name": "cross body crunch",
          "target": "abs",
          "description": "Lie down on your back with your knees bent and hands behind your head. Crunch up, bringing your left elbow to your right knee while extending your left leg out straight. Lower back down and repeat on the other side, bringing your right elbow to your left knee while extending your right leg out straight.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0276.gif",
          "id": "0276",
          "name": "dead bug",
          "target": "abs",
          "description": "Lie down on your back with your arms and legs in the air, knees bent at a 90-degree angle. Lower your right arm and left leg towards the ground, then return to the starting position and repeat on the other side.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0870.gif",
          "id": "0870",
          "name": "butt-ups",
          "target": "abs",
          "description": "Lie down on your back with your legs straight up in the air and your hands under your hips. Lift your hips off the ground, squeezing your glutes and engaging your abs. Lower back down and repeat for 30 seconds.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0260.gif",
          "id": "0260",
          "name": "cocoons",
          "target": "abs",
          "description": "Lie down on your back with your hands behind your head and legs raised and bent at a 90-degree angle. Crunch up and reach your right elbow towards your left knee while straightening your right leg out. Lower back down and repeat on the other side, reaching your left elbow towards your right knee while straightening your left leg out.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0001.gif",
          "id": "0001",
          "name": "3/4 sit-up",
          "target": "abs",
          "description": "Lie down on your back with your knees bent and feet flat on the floor. Place your hands behind your head and lift your shoulders off the floor, bringing your elbows towards your knees.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0267.gif",
          "id": "0267",
          "name": "crunch (hands overhead)",
          "target": "abs",
          "description": "Lie down on your back with your arms extended overhead and legs bent at a 90-degree angle. Lift your shoulders off the floor and reach your hands towards your feet, squeezing your abs.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0006.gif",
          "id": "0006",
          "name": "alternate heel touchers",
          "target": "abs",
          "description": "Lie down on your back with your knees bent and feet flat on the floor. Lift your shoulders off the floor and twist to the right, touching your right heel with your right hand. Return to the starting position and repeat on the other side, touching your left heel with your left hand.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/2466.gif",
          "id": "2466",
          "name": "bridge - mountain climber (cross body)",
          "target": "abs",
          "description": "Start in a plank position with your hands on the ground and your body in a straight line. Bring your right knee towards your left elbow, then return to the starting position and repeat on the other side, bringing your left knee towards your right elbow.",
          "time": 30
        },
        {
          "bodyPart": "upper legs",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/1512.gif",
          "id": "1512",
          "name": "all fours squad stretch",
          "target": "quads",
          "description": "Start on your hands and knees with your wrists directly under your shoulders and your knees directly under your hips. Lift your knees off the ground and straighten your legs, coming into a squat position.",
          "time": 30
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/1468.gif",
          "id": "1468",
          "name": "crab twist toe touch",
          "target": "abs",
          "description": "Crab Twist Toe Touch: Sit on the ground with your knees bent and feet flat on the floor, then lift your hips off the ground, coming into a crab position with your hands behind your head. Twist your torso to the right and touch your left elbow to your right knee, then twist to the left and touch your right elbow to your left knee.",
          "time": 30
        }
      ]
    },
    {
      "id": 2,
      "name": "Core Crusher\n(For Professionals)",
      "description": "This workout is designed for professionals to challenge their core muscles and improve overall strength and conditioning. The workout includes 15 exercises that target the abs and waist using bodyweight only.\nPerform each exercise for 45 seconds, with a 15-second rest in between.",
      "image": "https://wallpaperaccess.com/full/1244858.jpg",
      "exercises": [
        {
          "bodyPart": "chest",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/3294.gif",
          "id": "3294",
          "name": "archer push up",
          "target": "pectorals",
          "description": "Start in a plank position with your hands wider than shoulder-width apart, shift your weight onto your left hand and bend your right arm, lowering your body towards the ground. As you push back up, rotate your body and raise your right arm straight up towards the ceiling, ending in a side plank position. Lower back down and repeat on the other side.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0262.gif",
          "id": "0262",
          "name": "cross body crunch",
          "target": "abs",
          "description": "Lie on your back with your knees bent and feet flat on the ground. Place your hands behind your head and lift your head and shoulders off the ground, bringing your right elbow towards your left knee. Lower back down and repeat on the other side.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0003.gif",
          "id": "0003",
          "name": "air bike",
          "target": "abs",
          "description": "Lie on your back with your hands behind your head and lift your head, shoulders, and feet off the ground. Alternate bringing your right elbow to your left knee and your left elbow to your right knee, while keeping your legs in a cycling motion.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0276.gif",
          "id": "0276",
          "name": "dead bug",
          "target": "abs",
          "description": "Lie on your back with your arms and legs up towards the ceiling. Lower your right arm and left leg towards the ground, while keeping your back flat on the ground. Return to starting position and repeat on the other side.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0138.gif",
          "id": "0138",
          "name": "bottoms-up",
          "target": "abs",
          "description": "Lie on your back with your legs straight up towards the ceiling and arms straight up towards the ceiling. Lower both your arms and legs towards the ground, keeping them straight, and then lift back up to starting position.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0260.gif",
          "id": "0260",
          "name": "cocoons",
          "target": "abs",
          "description": "Lie on your back with your hands behind your head and your legs lifted, then crunch, bringing your knees towards your chest and your elbows towards your knees. Extend your legs and arms and repeat.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0267.gif",
          "id": "0267",
          "name": "crunch (hands overhead)",
          "target": "abs",
          "description": "Lie on your back with your arms extended towards the ceiling, then crunch, bringing your shoulders off the ground and reaching your hands towards your feet.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/1468.gif",
          "id": "1468",
          "name": "crab twist toe touch",
          "target": "abs",
          "description": "Sit on the ground with your knees bent and feet flat on the floor, then lift your hips off the ground, coming into a crab position with your hands behind your head. Twist your torso to the right and touch your left hand to your right foot, then repeat on the other side.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/3204.gif",
          "id": "3204",
          "name": "arms overhead full sit-up (male)",
          "target": "abs",
          "description": "Lie on your back with your arms extended towards the ceiling, then sit up, reaching your hands towards your feet. Return to starting position and repeat.",
          "time": 45
        },
        {
          "bodyPart": "upper legs",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/1512.gif",
          "id": "1512",
          "name": "all fours squad stretch",
          "target": "quads",
          "description": "Begin on all fours with your hands shoulder-width apart and your knees hip-width apart. Lift your knees off the ground and straighten your legs, then lower back down and repeat.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/2466.gif",
          "id": "2466",
          "name": "bridge - mountain climber (cross body)",
          "target": "abs",
          "description": "Begin in a bridge position with your hands shoulder-width apart and your feet flat on the ground. Bring your right knee towards your left elbow, then return to starting position and repeat on the other side.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0274.gif",
          "id": "0274",
          "name": "crunch floor",
          "target": "abs",
          "description": "Lie on your back with your knees bent and feet flat on the floor, then crunch, bringing your shoulders off the ground and reaching your hands towards your feet.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0001.gif",
          "id": "0001",
          "name": "3/4 sit-up",
          "target": "abs",
          "description": "Lie on your back with your knees bent and feet flat on the floor, then sit up halfway, reaching your hands towards your feet. Return to starting position and repeat.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0006.gif",
          "id": "0006",
          "name": "alternate heel touchers",
          "target": "abs",
          "description": "Lie on your back with your knees bent and feet flat on the floor, then crunch, bringing your right hand towards your right heel and then your left hand towards your left heel.",
          "time": 45
        },
        {
          "bodyPart": "waist",
          "equipment": "body weight",
          "gifUrl": "http://d205bpvrqc9yn1.cloudfront.net/0870.gif",
          "id": "0870",
          "name": "butt-ups",
          "target": "abs",
          "description": "Lie on your back with your hands by your sides and your legs lifted, then lift your hips off the ground towards the ceiling. Lower back down and repeat.",
          "time": 45
        }
      ]
    }
  ]
}